README.org
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

# #+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
# #+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
# # #+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
# #+HTML_HEAD: <script type="text/javascript" src="https://unpkg.com/sticky-table-headers"></script>

# #+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD_EXTRA: <style> pre.src { background-color: #292e34; color: white; }</style>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
# #+OPTIONS: toc:nil
# This is a template for pushing out org files that are compatible with both
# HTML and latex export. Specifically, these files Support code highlighting -
# for clojure code - and typeset the code to look different from the main
# sections. The design is meant for providing a quick template to inject clojure
# source into org docs, and provide an interactive, REPL-friendly presentation.
#+TITLE: M4HPC
#+AUTHOR: M4 Dev
#+DATE: 21 January 2026
#+VERSION: 1.2

* High Performance Computing APIs for M4
This is a working implementation of running M4 on 'nix systems with the Portable
Batch System installed.

* Current Release
[[http://marathon-site.s3-website-us-gov-west-1.amazonaws.com/releases/m4-2.25.jar][
m4-2.25.jar]]

* M4 Entry Points
** GUI
For the M4 uberjar, the main entrypoint actually delegates to a
lightweight launcher to simplify the end-user experience, and act more like an
"app" they can just 2x click to use in a typical environmet (e.g., Windows or XWindows).

To this end, we typically want to leverage (for commodity hardware) 2-4gb of
heap, and we want to ensure we're using the parallel GC instead of the later
(Java 9+) default G1GC due to measured throughput benefits.

So one way to get a running instance in a Windows or XWindows environment is to just
2x click the jar file.

** CLI
If invoked via a java command from the CLI, the entry point will scrape any CLI-supplied JVM args and apply
them to the subprocess (with some logging to indicate what actually launched).
This allows callers to supply custom configuration for the production jvm process.

If no args are supplied (e.g., akin to a user just 2x clicks the jar file), then we
default to -Xmx4g -XX:+UseParallelGC for the heap and GC args respectively.

** Predefined CLI Args
*** <none>
A 0-arg invocation ala

#+BEGIN_SRC shell
java -jar m4-2.23.jar
#+END_SRC

Will launch the marathon.main/-main entrypoint, and ultimately try to intialize
the GUI environment. This is more of the "app" mode intended for interactive use
and analysis, and is undesirable for headless work.

*** peer
#+BEGIN_SRC shell
java -jar m4-2.23.jar peer
#+END_SRC

Will initialize an M4 peer instance that will connect to other peers using the Hazelcast
https://hazelcast.com/ distributed computing framework.  This particular use-case
is discussed in depth under [[id:distributedID][Distributed Clojure REPL Using Hazelcast]] .

The peer will look for hazelcast configurations (specified currently as clojure .edn
data structure files) in order of precedence:

- ./hazelcast.edn
- ~/.hazelcast/hazelcast.edn
- HAZELCAST environment var (limited to specific AWS EC2 use cases).

After initial configuration, the process will dump into a clojure repl in
the m4peer.core namespace with marathon-related infrastucture preloaded and
available for use in distributed workflows (both pre-built and emergent/user-defined
on the distributed REPL).

This enables common workloads (like firing up multiple headless peers over SSH)
with preconfigured distributed mapping of workloads, distributed evaluation of clojure
expressions from the REPL, distributed compilation/recompilation, etc.

For more information on the Clojure wrapper used and the simplified hazelcast.edn
setup, see https://github.com/joinr/hazeldemo.

The utility of running peers in this prescribed way is that "normal" users performing TAA analyses don't
have to know about the peers.  To them, all invocations look the same (even the cluster discovery process
and work distribution is transparent).  They only have to opt-in to executing on a cluster by modifying
the basic TAA input map to include the specific key:

#+BEGIN_SRC clojure
  {... elided
   :run-site :cluster}
#+END_SRC

The TAA pipeline will pick up on this key and (if necessary) establish a local
peer on the user's machine, connect to the extant cluster using whatever the
hazelcast configuration defines, and then farm out runs from the pipeline using
a work stealing queue with peers picking up the load and Hazelcast handling load
balancing.

Callers can also leverage arbitrary distributed computation in their scripts,
e.g. to supplement analyses or define emergent workflows that go beyond the
extant TAA pipeline. Peers are still useful here, since they will be listening
for work/messages with the same dependencies the user has, thus enabling general
purpose distributed computing from the REPL.

*** repl
#+BEGIN_SRC shell
java -jar m4-2.23.jar repl
#+END_SRC

is equivalent to:
#+BEGIN_SRC shell
java -jar m4-2.23.jar clojure.main/repl
#+END_SRC

It serves as a means to establish a vanilla clojure REPL with the M4 jar file (and all associated
libraries) on the classpath, but without anything loaded.  This can be used as an arbitrary
scripting environment with faster load times than pulling in all the M4 infrastructure.  On austere
air-gapped systems, we get a clojure development/scripting environment with many useful libraries
pre-packaged.

See https://clojure.org/reference/repl_and_main for relevant optional arguments.
