README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-21 Wed 10:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>M4HPC</title>
<meta name="author" content="M4 Dev" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">M4HPC</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2117566">1. High Performance Computing APIs for M4</a></li>
<li><a href="#org5996c03">2. Current Release</a></li>
<li><a href="#org826a793">3. M4 Entry Points</a>
<ul>
<li><a href="#org5482480">3.1. GUI</a></li>
<li><a href="#orgc18b89d">3.2. CLI</a></li>
<li><a href="#org4171c4e">3.3. Predefined CLI Args</a>
<ul>
<li><a href="#org03bc0f8">3.3.1. &lt;none&gt;</a></li>
<li><a href="#org6c28986">3.3.2. peer</a></li>
<li><a href="#orgce575ad">3.3.3. repl</a></li>
<li><a href="#org989f312">3.3.4. main</a></li>
<li><a href="#orgd8171e1">3.3.5. clojure.main (bypass the launcher)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8a7cd1d">4. Distributed Clojure REPL Using Hazelcast</a>
<ul>
<li><a href="#org7025216">4.1. Assumptions</a></li>
<li><a href="#org618fd9b">4.2. Workflow</a></li>
<li><a href="#org7c3fb74">4.3. hazelcast.edn</a></li>
<li><a href="#org7267bf1">4.4. peers.pbs</a>
<ul>
<li><a href="#org084b08d">4.4.1. Alternative PBS Method (Pending)</a></li>
</ul>
</li>
<li><a href="#org6b6acfc">4.5. Helper Scripts for peers and master</a></li>
<li><a href="#org4468514">4.6. Demo</a></li>
</ul>
</li>
<li><a href="#org44a06e6">5. Distributed M4 Runs Using Run Plans and PBS JobArrays</a>
<ul>
<li><a href="#orgb60d3d2">5.1. Creating Run Plans</a></li>
<li><a href="#orga74d54e">5.2. Emitting Run Plans</a>
<ul>
<li><a href="#org9480e68">5.2.1. workbook</a></li>
<li><a href="#org8d046e9">5.2.2. input-map</a></li>
<li><a href="#org56be10c">5.2.3. node-count</a></li>
</ul>
</li>
<li><a href="#org73003df">5.3. Planning vs. Execution</a>
<ul>
<li><a href="#orgf3d6b8b">5.3.1. Setup</a></li>
</ul>
</li>
<li><a href="#orga2a1d97">5.4. Per-Node Execution</a></li>
<li><a href="#org8731e88">5.5. Job Submission</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2117566" class="outline-2">
<h2 id="org2117566"><span class="section-number-2">1.</span> High Performance Computing APIs for M4</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a working implementation of running M4 on 'nix systems with the Portable
Batch System installed.
</p>
</div>
</div>
<div id="outline-container-org5996c03" class="outline-2">
<h2 id="org5996c03"><span class="section-number-2">2.</span> Current Release</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://marathon-site.s3-website-us-gov-west-1.amazonaws.com/releases/m4-2.25.jar">
m4-2.25.jar</a>
</p>
</div>
</div>
<div id="outline-container-org826a793" class="outline-2">
<h2 id="org826a793"><span class="section-number-2">3.</span> M4 Entry Points</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5482480" class="outline-3">
<h3 id="org5482480"><span class="section-number-3">3.1.</span> GUI</h3>
<div class="outline-text-3" id="text-3-1">
<p>
For the M4 uberjar, the main entrypoint actually delegates to a
lightweight launcher to simplify the end-user experience, and act more like an
"app" they can just 2x click to use in a typical environmet (e.g., Windows or XWindows).
</p>

<p>
To this end, we typically want to leverage (for commodity hardware) 2-4gb of
heap, and we want to ensure we're using the parallel GC instead of the later
(Java 9+) default G1GC due to measured throughput benefits.
</p>

<p>
So one way to get a running instance in a Windows or XWindows environment is to just
2x click the jar file.
</p>
</div>
</div>
<div id="outline-container-orgc18b89d" class="outline-3">
<h3 id="orgc18b89d"><span class="section-number-3">3.2.</span> CLI</h3>
<div class="outline-text-3" id="text-3-2">
<p>
If invoked via a java command from the CLI, the entry point will scrape any CLI-supplied JVM args and apply
them to the subprocess (with some logging to indicate what actually launched).
This allows callers to supply custom configuration for the production jvm process.
</p>

<p>
If no args are supplied (e.g., akin to a user just 2x clicks the jar file), then we
default to -Xmx4g -XX:+UseParallelGC for the heap and GC args respectively.
</p>
</div>
</div>
<div id="outline-container-org4171c4e" class="outline-3">
<h3 id="org4171c4e"><span class="section-number-3">3.3.</span> Predefined CLI Args</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org03bc0f8" class="outline-4">
<h4 id="org03bc0f8"><span class="section-number-4">3.3.1.</span> &lt;none&gt;</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
A 0-arg invocation ala
</p>

<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar
</pre>
</div>

<p>
Will launch the marathon.main/-main entrypoint, and ultimately try to intialize
the GUI environment. This is more of the "app" mode intended for interactive use
and analysis, and is undesirable for headless work.
</p>
</div>
</div>
<div id="outline-container-org6c28986" class="outline-4">
<h4 id="org6c28986"><span class="section-number-4">3.3.2.</span> peer</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar peer
</pre>
</div>

<p>
Will initialize an M4 peer instance that will connect to other peers using the Hazelcast
<a href="https://hazelcast.com/">https://hazelcast.com/</a> distributed computing framework.  This particular use-case
is discussed in depth under <a href="#org8a7cd1d">Distributed Clojure REPL Using Hazelcast</a> .
</p>

<p>
The peer will look for hazelcast configurations (specified currently as clojure .edn
data structure files) in order of precedence:
</p>

<ul class="org-ul">
<li>./hazelcast.edn</li>
<li>~/.hazelcast/hazelcast.edn</li>
<li>HAZELCAST environment var (limited to specific AWS EC2 use cases).</li>
</ul>

<p>
After initial configuration, the process will dump into a clojure repl in
the m4peer.core namespace with marathon-related infrastucture preloaded and
available for use in distributed workflows (both pre-built and emergent/user-defined
on the distributed REPL).
</p>

<p>
This enables common workloads (like firing up multiple headless peers over SSH)
with preconfigured distributed mapping of workloads, distributed evaluation of clojure
expressions from the REPL, distributed compilation/recompilation, etc.
</p>

<p>
For more information on the Clojure wrapper used and the simplified hazelcast.edn
setup, see <a href="https://github.com/joinr/hazeldemo">https://github.com/joinr/hazeldemo</a>.
</p>

<p>
The utility of running peers in this prescribed way is that "normal" users performing TAA analyses don't
have to know about the peers.  To them, all invocations look the same (even the cluster discovery process
and work distribution is transparent).  They only have to opt-in to executing on a cluster by modifying
the basic TAA input map to include the specific key:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">{</span>... elided
 <span style="color: #a45bad;">:run-site</span> <span style="color: #a45bad;">:cluster</span><span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
The TAA pipeline will pick up on this key and (if necessary) establish a local
peer on the user's machine, connect to the extant cluster using whatever the
hazelcast configuration defines, and then farm out runs from the pipeline using
a work stealing queue with peers picking up the load and Hazelcast handling load
balancing.
</p>

<p>
Callers can also leverage arbitrary distributed computation in their scripts,
e.g. to supplement analyses or define emergent workflows that go beyond the
extant TAA pipeline. Peers are still useful here, since they will be listening
for work/messages with the same dependencies the user has, thus enabling general
purpose distributed computing from the REPL.
</p>
</div>
</div>
<div id="outline-container-orgce575ad" class="outline-4">
<h4 id="orgce575ad"><span class="section-number-4">3.3.3.</span> repl</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar repl
</pre>
</div>

<p>
is equivalent to:
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar clojure.main/repl
</pre>
</div>

<p>
It serves as a means to establish a vanilla clojure REPL with the M4 jar file (and all associated
libraries) on the classpath, but without anything loaded.  This can be used as an arbitrary
scripting environment with faster load times than pulling in all the M4 infrastructure.  On austere
air-gapped systems, we get a clojure development/scripting environment with many useful libraries
pre-packaged.
</p>

<p>
See <a href="https://clojure.org/reference/repl_and_main">https://clojure.org/reference/repl_and_main</a> for relevant optional arguments.
</p>
</div>
</div>
