README.org
*** main
#+BEGIN_SRC shell
java -jar m4-2.23.jar main
#+END_SRC
is equivalent to:
#+BEGIN_SRC shell
java -jar m4-2.23.jar clojure.main
#+END_SRC

with the exception that the launcher will inject default args on the caller's
behalf.
#+BEGIN_SRC shell
java -jar m4-2.23.jar  main -e "(println \"hello world\")"
{:launching-subprocess "java -XX:+UseParallelGC -jar m4-2.23.jar entry \"main\" \"-e\" \"(println \\\"hello world\\\")\"", :jvm-args ["-XX:+UseParallelGC"], :user-args ["main" "-e" "(println \"hello world\")"], :args ("main" "-e" "(println \"hello world\")")}
hello world
#+END_SRC

Given a simple Clojure script, blah.clj:
#+BEGIN_SRC clojure
(println "Hello world!")
#+END_SRC

We can simply load it through main:
#+BEGIN_SRC shell
java -jar m4-2.23.jar  main blah.clj
{:launching-subprocess "java -XX:+UseParallelGC -jar m4-2.23.jar entry \"main\" \"blah.clj\"", :jvm-args ["-XX:+UseParallelGC"], :user-args ["main" "blah.clj"], :args ("main" "blah.clj")}
Hello world!
#+END_SRC

Through this we have a general means for invoking arbitrary clojure programs:

#+BEGIN_SRC shell
java -jar m4-2.23.jar main domanyruns.clj
#+END_SRC

See https://clojure.org/reference/repl_and_main for relevant optional arguments.

*** clojure.main (bypass the launcher)
We can have direct control over a single jvm process if we launch with
clojure.main.  This bypasses the lancher entirely and possibly saves some time/resources.
Since we're bypassing the launcher, all jvm settings are default (e.g. Xmx and GC settings),
which puts the burden on the caller to configure their invocation correctly.
#+BEGIN_SRC shell
java -jar m4-4.2.24.jar  clojure.main -e "(println \"hello world\")"
<caller specified clojure.main from cli, bypassing launcher>
hello world
#+END_SRC

Similarly, we can load clojure programs as with main:
#+BEGIN_SRC shell
java -jar m4-2.23.jar  clojure.main blah.clj
<caller specified clojure.main from cli, bypassing launcher>
Hello world!
#+END_SRC

* Distributed Clojure REPL Using Hazelcast
:PROPERTIES:
:ID: distributedID
:END:

Scripts referenced below may be found in the /peer folder, and input data
(primarily a MARATHON worbook) in the /data folder.

** Assumptions
- The sole system dependency is a JVM >= 1.8

- The working directory is readable/writeable from the compute nodes in a
  particular job (or we can target such a shared location)

- The session in this script is meant to be launched as an interactive job via
  SSH, where we (the user) attach so an arbitrary compute node (dubbed the
  master node), and we initiate ad-hoc clustering with a supplemental script
  (launch-it) to get an interactive clojure REPL with distributed compute
  capability amongst all the peers.

- We have configured inputs for study analysis (e.g., a TAA useage.clj file that
  references input data on the shared file system)

- We have write access to desired output directories as necessary (e.g., paths
  specified in the TAA usage script).

- We have a ~/hazelcast.edn file that all peers can read to share a common
  hazelcast configuration and discovery strategy.

- All the peers have write acess to the path indicated in the ~/hazelcast.edn
  file so that they can register themselves for auto-discovery and cluster
  joining.

** Workflow

- User connects to an HPC system with the above setup.
  - hazelcast.edn
  - peers.pbs
  - master.sh
  - peer.sh
  - launchit.sh
  - (optional) runit.sh

- User invokes this PBS script (or a modified version) to
  get an interactive session, either from the CLI or
  from an optional script like runit.sh:
  #+BEGIN_SRC shell
  qsub -i peers.pbs
  #+END_SRC

- The job is queued and the user is left with an ssh connection
  to what we deem "the master node".
- User then invokes a supplemental script to initiate
  the peers.
  #+BEGIN_SRC shell
  ./sh launchit.sh
  #+END_SRC
  - Note: this differs a bit when compared to the PET guidance
    where everything is coordinated from the PBS file over ssh.
    We will revisit that since it's a mildly cleaner design, if
    it can be made to work (definitely user error at this point).

** hazelcast.edn
We use the default companion ~/hazelcast.edn which will provide the default
connection configuration for any peers launching from this filesystem. Since
the filesystem gets mounted to each peer during job submission time (they all
have the user's home directory mapped, at least on Betty), they will all pick
up ~/hazelcast.edn which tells them to use tcp/ip discovery and register their
IP's in ~/registry for the ad-hoc cluster and message services.

#+BEGIN_SRC clojure
  {:id "dev"
   :join :tcp
   :members {:file/path "./registry"}
   :register-on-join true}
#+END_SRC

