README.html
<div id="outline-container-org989f312" class="outline-4">
<h4 id="org989f312"><span class="section-number-4">3.3.4.</span> main</h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar main
</pre>
</div>
<p>
is equivalent to:
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar clojure.main
</pre>
</div>

<p>
with the exception that the launcher will inject default args on the caller's
behalf.
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar  main -e <span style="color: #2d9574;">"(println \"hello world\")"</span>
<span style="color: #4f97d7;">{</span>:launching-subprocess <span style="color: #2d9574;">"java -XX:+UseParallelGC -jar m4-2.23.jar entry \"main\" \"-e\" \"(println \\\"hello world\\\")\""</span>, :jvm-args <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"-XX:+UseParallelGC"</span><span style="color: #bc6ec5;">]</span>, :user-args <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"main"</span> <span style="color: #2d9574;">"-e"</span> <span style="color: #2d9574;">"(println \"hello world\")"</span><span style="color: #bc6ec5;">]</span>, :args <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"main"</span> <span style="color: #2d9574;">"-e"</span> <span style="color: #2d9574;">"(println \"hello world\")"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">}</span>
hello world
</pre>
</div>

<p>
Given a simple Clojure script, blah.clj:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>println <span style="color: #2d9574;">"Hello world!"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
We can simply load it through main:
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar  main blah.clj
<span style="color: #4f97d7;">{</span>:launching-subprocess <span style="color: #2d9574;">"java -XX:+UseParallelGC -jar m4-2.23.jar entry \"main\" \"blah.clj\""</span>, :jvm-args <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"-XX:+UseParallelGC"</span><span style="color: #bc6ec5;">]</span>, :user-args <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"main"</span> <span style="color: #2d9574;">"blah.clj"</span><span style="color: #bc6ec5;">]</span>, :args <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"main"</span> <span style="color: #2d9574;">"blah.clj"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">}</span>
Hello world!
</pre>
</div>

<p>
Through this we have a general means for invoking arbitrary clojure programs:
</p>

<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar main domanyruns.clj
</pre>
</div>

<p>
See <a href="https://clojure.org/reference/repl_and_main">https://clojure.org/reference/repl_and_main</a> for relevant optional arguments.
</p>
</div>
</div>
<div id="outline-container-orgd8171e1" class="outline-4">
<h4 id="orgd8171e1"><span class="section-number-4">3.3.5.</span> clojure.main (bypass the launcher)</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
We can have direct control over a single jvm process if we launch with
clojure.main.  This bypasses the lancher entirely and possibly saves some time/resources.
Since we're bypassing the launcher, all jvm settings are default (e.g. Xmx and GC settings),
which puts the burden on the caller to configure their invocation correctly.
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-4.2.24.jar  clojure.main -e <span style="color: #2d9574;">"(println \"hello world\")"</span>
&lt;caller specified clojure.main from cli, bypassing launcher&gt;
hello world
</pre>
</div>

<p>
Similarly, we can load clojure programs as with main:
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar m4-2.23.jar  clojure.main blah.clj
&lt;caller specified clojure.main from cli, bypassing launcher&gt;
Hello world!
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org8a7cd1d" class="outline-2">
<h2 id="org8a7cd1d"><span class="section-number-2">4.</span> Distributed Clojure REPL Using Hazelcast</h2>
<div class="outline-text-2" id="text-4">
<p>
Scripts referenced below may be found in the /peer folder, and input data
(primarily a MARATHON worbook) in the /data folder.
</p>
</div>
<div id="outline-container-org7025216" class="outline-3">
<h3 id="org7025216"><span class="section-number-3">4.1.</span> Assumptions</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>The sole system dependency is a JVM &gt;= 1.8</li>

<li>The working directory is readable/writeable from the compute nodes in a
particular job (or we can target such a shared location)</li>

<li>The session in this script is meant to be launched as an interactive job via
SSH, where we (the user) attach so an arbitrary compute node (dubbed the
master node), and we initiate ad-hoc clustering with a supplemental script
(launch-it) to get an interactive clojure REPL with distributed compute
capability amongst all the peers.</li>

<li>We have configured inputs for study analysis (e.g., a TAA useage.clj file that
references input data on the shared file system)</li>

<li>We have write access to desired output directories as necessary (e.g., paths
specified in the TAA usage script).</li>

<li>We have a ~/hazelcast.edn file that all peers can read to share a common
hazelcast configuration and discovery strategy.</li>

<li>All the peers have write acess to the path indicated in the ~/hazelcast.edn
file so that they can register themselves for auto-discovery and cluster
joining.</li>
</ul>
</div>
</div>
<div id="outline-container-org618fd9b" class="outline-3">
<h3 id="org618fd9b"><span class="section-number-3">4.2.</span> Workflow</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>User connects to an HPC system with the above setup.
<ul class="org-ul">
<li>hazelcast.edn</li>
<li>peers.pbs</li>
<li>master.sh</li>
<li>peer.sh</li>
<li>launchit.sh</li>
<li>(optional) runit.sh</li>
</ul></li>

<li><p>
User invokes this PBS script (or a modified version) to
get an interactive session, either from the CLI or
from an optional script like runit.sh:
</p>
<div class="org-src-container">
<pre class="src src-shell">qsub -i peers.pbs
</pre>
</div></li>

<li>The job is queued and the user is left with an ssh connection
to what we deem "the master node".</li>
<li><p>
User then invokes a supplemental script to initiate
the peers.
</p>
<div class="org-src-container">
<pre class="src src-shell">./sh launchit.sh
</pre>
</div>
<ul class="org-ul">
<li>Note: this differs a bit when compared to the PET guidance
where everything is coordinated from the PBS file over ssh.
We will revisit that since it's a mildly cleaner design, if
it can be made to work (definitely user error at this point).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7c3fb74" class="outline-3">
<h3 id="org7c3fb74"><span class="section-number-3">4.3.</span> hazelcast.edn</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We use the default companion ~/hazelcast.edn which will provide the default
connection configuration for any peers launching from this filesystem. Since
the filesystem gets mounted to each peer during job submission time (they all
have the user's home directory mapped, at least on Betty), they will all pick
up ~/hazelcast.edn which tells them to use tcp/ip discovery and register their
IP's in ~/registry for the ad-hoc cluster and message services.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">{</span><span style="color: #a45bad;">:id</span> <span style="color: #2d9574;">"dev"</span>
 <span style="color: #a45bad;">:join</span> <span style="color: #a45bad;">:tcp</span>
 <span style="color: #a45bad;">:members</span> <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:</span><span style="color: #ce537a; font-weight: bold;">file</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">path</span> <span style="color: #2d9574;">"./registry"</span><span style="color: #bc6ec5;">}</span>
 <span style="color: #a45bad;">:register-on-join</span> <span style="color: #a45bad;">true</span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
