README.org
** peers.pbs
The included sample allocates 5 nodes (we can change this with CLI args, or just
modify the select PBS arg for select).

We'll leverage the example from PET guides to build a node_list that our head
node can use to launch peers. node_list.txt will be populated with the
resolvable names of each node in our PBS job (e.g., for a select=5 job, we
expect to see a text file with the names of 5 nodes, one per line).

Then we'll qsub will interactively ssh us into the master node so we can
go work.

#+BEGIN_SRC shell
  #!/bin/bash
  #PBS -A OARMY5244AH96
  #PBS -q standard
  #PBS -l select=5
  #PBS -l walltime=1:00:00

  cat $PBS_NODEFILE | sort -u > node_list.txt
  NNODES=$(cat node_list.txt | wc -l)

  ridx=1
  ROOTNODE=$(sed "${ridx}q;d" node_list.txt)

  echo "ssh into master node, use launchit.sh to connect to cluster"
  ssh $ROOTNODE
#+END_SRC


*** Alternative PBS Method (Pending)

Alternately (ideally) this would do the same thing with no manual
intervention, but I lack the skills to get it working at the moment.

#+BEGIN_SRC shell
  #!/bin/bash
  #PBS -A OARMY5244AH96
  #PBS -q standard
  #PBS -l select=5
  #PBS -l walltime=1:00:00

  cat $PBS_NODEFILE | sort -u > node_list.txt
  NNODES=$(cat node_list.txt | wc -l)

  ridx=1
  ROOTNODE=$(sed "${ridx}q;d" node_list.txt)

  echo "ssh into master node, use launchit.sh to connect to cluster"
  ssh $ROOTNODE "sh launchit.sh"
#+END_SRC

Or we do all the work that launchit.sh does (spawning peers) from the PBS file.

This is what PET suggested, but I couldn't get it to work on my end. Instead, we
just ssh into a node and kick off the process manually.

We should be able to do this though, I just ran out of time getting it to work.
#+BEGIN_SRC shell
  #!/bin/bash
  #PBS -A OARMY5244AH96
  #PBS -q standard
  #PBS -l select=5
  #PBS -l walltime=1:00:00

  cat $PBS_NODEFILE | sort -u > node_list.txt
  NNODES=$(cat node_list.txt | wc -l)

  ridx=1
  ROOTNODE=$(sed "${ridx}q;d" node_list.txt)

  for ((i = 2; i<=$NNODES;i++))
    do
      MYNODE=$(sed "${i}q;d" node_list.txt)
      ssh $MYNODE ./runpeer.sh &
  ssh $ROOTNODE ./runmaster.sh
#+END_SRC

** Helper Scripts for peers and master

We provide a couple of companion scripts that serve as hook sites for
configuring peers and the master node.

For now, they are identical, but we expect the scripts ~/runpeer.sh and
~/runmaster.sh to be present.

They contain our java CLI invocations for setting up the JVM with the
appropriate args (typically -Xmx###g) depending on the compute node's
capabilities. E.g., if we know our nodes can accomodate a 250gb heap, then we
can have -Xmx250g or any other JVM args.

If we want to handle the master node we're interacting from differently, then
this is where we can hook in later. Also adapted from PET guide.

** Demo

The folder /peer/usagedemo contains the sole input and script
necessary for doing distributed runs using the generic peer
infrastructure from above.

* Distributed M4 Runs Using Run Plans and PBS JobArrays
While the interactive mode is extremely flexible and useful for runs of
limited scope, if we need to truly scale out, and the workload might
persist for days or weeks, then we have to explore offline methods
of job submission.

The PBS system provides a simple extension for bulk workloads that
can be expressed via a simple incrementing index that maps to the work.
If we can express our experimental design as a deterministic run plan,
and we have a means of loading pieces of work based on an integer index,
then we can leverage the job array system to submit scalable workloads
for non-interactive work.

Any scripts referenced below will be located in the /jobarray folder,
with input data in the /data folder.

A current MARATHON jar (as linked at the top of this file) must also
be available to every potential node.

** Creating Run Plans
The normal mechanism for our bulk (e.g., TAA) processing follows
on online, streaming model where we have a work queue with distributed
workers.  In this scheme, we don't really care about the total extent
of the work - we just keep pushing work onto the queue until we're done,
while workers take work and submit results.  In this paradigm, we
don't intend to follow an optimal (globally or locally) distribution
of work amongst peers; instead we let the system load balance using
hueristics and work stealing.  As such, the actual scheduling of work
to nodes is intentionally abstracted.  To have a determinstic mapping of
work-items to nodes, we need to change this and develop a plan for how
our runs are scheduled.

