README.html
<div id="outline-container-org7267bf1" class="outline-3">
<h3 id="org7267bf1"><span class="section-number-3">4.4.</span> peers.pbs</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The included sample allocates 5 nodes (we can change this with CLI args, or just
modify the select PBS arg for select).
</p>

<p>
We'll leverage the example from PET guides to build a node<sub>list</sub> that our head
node can use to launch peers. node<sub>list.txt</sub> will be populated with the
resolvable names of each node in our PBS job (e.g., for a select=5 job, we
expect to see a text file with the names of 5 nodes, one per line).
</p>

<p>
Then we'll qsub will interactively ssh us into the master node so we can
go work.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -A OARMY5244AH96</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -q standard</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l select=5</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l walltime=1:00:00</span>

cat $<span style="color: #7590db;">PBS_NODEFILE</span> | sort -u &gt; node_list.txt
<span style="color: #7590db;">NNODES</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cat node_list.txt | wc -l</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">ridx</span>=<span style="color: #a45bad;">1</span>
<span style="color: #7590db;">ROOTNODE</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">sed "${ridx}q;d" node_list.txt</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"ssh into master node, use launchit.sh to connect to cluster"</span>
ssh $<span style="color: #7590db;">ROOTNODE</span>
</pre>
</div>
</div>
<div id="outline-container-org084b08d" class="outline-4">
<h4 id="org084b08d"><span class="section-number-4">4.4.1.</span> Alternative PBS Method (Pending)</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Alternately (ideally) this would do the same thing with no manual
intervention, but I lack the skills to get it working at the moment.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -A OARMY5244AH96</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -q standard</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l select=5</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l walltime=1:00:00</span>

cat $<span style="color: #7590db;">PBS_NODEFILE</span> | sort -u &gt; node_list.txt
<span style="color: #7590db;">NNODES</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cat node_list.txt | wc -l</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">ridx</span>=<span style="color: #a45bad;">1</span>
<span style="color: #7590db;">ROOTNODE</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">sed "${ridx}q;d" node_list.txt</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"ssh into master node, use launchit.sh to connect to cluster"</span>
ssh $<span style="color: #7590db;">ROOTNODE</span> <span style="color: #2d9574;">"sh launchit.sh"</span>
</pre>
</div>

<p>
Or we do all the work that launchit.sh does (spawning peers) from the PBS file.
</p>

<p>
This is what PET suggested, but I couldn't get it to work on my end. Instead, we
just ssh into a node and kick off the process manually.
</p>

<p>
We should be able to do this though, I just ran out of time getting it to work.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -A OARMY5244AH96</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -q standard</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l select=5</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l walltime=1:00:00</span>

cat $<span style="color: #7590db;">PBS_NODEFILE</span> | sort -u &gt; node_list.txt
<span style="color: #7590db;">NNODES</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cat node_list.txt | wc -l</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">ridx</span>=<span style="color: #a45bad;">1</span>
<span style="color: #7590db;">ROOTNODE</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">sed "${ridx}q;d" node_list.txt</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>i = <span style="color: #a45bad;">2</span>; i&lt;=$<span style="color: #7590db;">NNODES</span>;i++<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #7590db;">MYNODE</span>=$<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">sed "${i}q;d" node_list.txt</span><span style="color: #4f97d7;">)</span>
    ssh $<span style="color: #7590db;">MYNODE</span> ./runpeer.sh &amp;
ssh $<span style="color: #7590db;">ROOTNODE</span> ./runmaster.sh
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6b6acfc" class="outline-3">
<h3 id="org6b6acfc"><span class="section-number-3">4.5.</span> Helper Scripts for peers and master</h3>
<div class="outline-text-3" id="text-4-5">
<p>
We provide a couple of companion scripts that serve as hook sites for
configuring peers and the master node.
</p>

<p>
For now, they are identical, but we expect the scripts ~/runpeer.sh and
~/runmaster.sh to be present.
</p>

<p>
They contain our java CLI invocations for setting up the JVM with the
appropriate args (typically -Xmx###g) depending on the compute node's
capabilities. E.g., if we know our nodes can accomodate a 250gb heap, then we
can have -Xmx250g or any other JVM args.
</p>

<p>
If we want to handle the master node we're interacting from differently, then
this is where we can hook in later. Also adapted from PET guide.
</p>
</div>
</div>
<div id="outline-container-org4468514" class="outline-3">
<h3 id="org4468514"><span class="section-number-3">4.6.</span> Demo</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The folder /peer/usagedemo contains the sole input and script
necessary for doing distributed runs using the generic peer
infrastructure from above.
</p>
</div>
</div>
</div>
<div id="outline-container-org44a06e6" class="outline-2">
<h2 id="org44a06e6"><span class="section-number-2">5.</span> Distributed M4 Runs Using Run Plans and PBS JobArrays</h2>
<div class="outline-text-2" id="text-5">
<p>
While the interactive mode is extremely flexible and useful for runs of
limited scope, if we need to truly scale out, and the workload might
persist for days or weeks, then we have to explore offline methods
of job submission.
</p>

<p>
The PBS system provides a simple extension for bulk workloads that
can be expressed via a simple incrementing index that maps to the work.
If we can express our experimental design as a deterministic run plan,
and we have a means of loading pieces of work based on an integer index,
then we can leverage the job array system to submit scalable workloads
for non-interactive work.
</p>

<p>
Any scripts referenced below will be located in the /jobarray folder,
with input data in the /data folder.
</p>

<p>
A current MARATHON jar (as linked at the top of this file) must also
be available to every potential node.
</p>
</div>
<div id="outline-container-orgb60d3d2" class="outline-3">
<h3 id="orgb60d3d2"><span class="section-number-3">5.1.</span> Creating Run Plans</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The normal mechanism for our bulk (e.g., TAA) processing follows
on online, streaming model where we have a work queue with distributed
workers.  In this scheme, we don't really care about the total extent
of the work - we just keep pushing work onto the queue until we're done,
while workers take work and submit results.  In this paradigm, we
don't intend to follow an optimal (globally or locally) distribution
of work amongst peers; instead we let the system load balance using
hueristics and work stealing.  As such, the actual scheduling of work
to nodes is intentionally abstracted.  To have a determinstic mapping of
work-items to nodes, we need to change this and develop a plan for how
our runs are scheduled.
</p>
</div>
</div>
