README.org
** Emitting Run Plans
We can leverage much of the existing TAA pipeline to generate a
persistent plan.  From there, we can try to optimize our plan such
that the total makespan of the work is minimized, which naturally leads
to an even distribution of work across a set of nodes.

The inputs we care about are:
- a pre-supplied MARATHON workbook to provide a project we can manage in memory
- a companion TAA input-map that supplies transforms and other parameters that
  inform how a project is decomposed into design points and replications to
  ultimately constitute a batch of work (or simulation runs)
- how many nodes we expect to distribute the runs over
- a hueristic that helps us estimate the amount of effort or cost
  required for a particular design point.
  - We will use a simple estimate of the total supply of entities,
    since that strongly correlates with events in the simulation.

*** workbook
This is assumed to be pre-supplied to any nodes that need to get at it.
Specifically, we assume it is available relative to some known path.

We have 2 sample workbooks in /data
- ~m4_book_AP.xlsx~
- ~m4_book_BP.xlsx~

*** input-map
This is a clojure map either serialized in .edn format (e.g.
a readable clojure data structure that can be deserialized by
the clojure reader natively), or defined and used in-memory
within a clojure script.  Our examples will follow the in-memory
model, and we will have input maps for each workbook.

*** node-count
We intentionally keep this variable to allow our plan to
adapt to resourcing.

** Planning vs. Execution
The preferred approach is to have a reusable script that
can be used to both setup / emit a persistent run-plan,
in addition to performing incremental runs relative to
a job array index.

The ~batch_test.clj~ script provides an example and a minimal
API to build our PBS job on.  It supplies the relevant input
maps and workbook paths, as well as a function to emit an
optimized run-plan.

*** Setup
Since our method of plan generation is relatively cheap,
we want to build our plans outside of PBS.  Run plans
can then be propagated to worker nodes for them to
map a job array index to their relevant piece of the
run plan.

From either a clojure repl, or an aforementioned CLI
invocation, we can leverage the simplistic ~prep-batches~
function in conjuction with simple plan definitions in the
~default-plans~ var.

If we nothing to modify the script, any invocation of
the 0-arity ~prep-batches~ will leverage ~default-plans~ to
do its work:

#+BEGIN_SRC clojure
  (load-file "batch_test.clj") ;;load and eval arbitrary source file.
  (in-ns 'batch-test) ;;switch the repl namespace to batch-test
  ;;These values are already defined.  We could change them
  ;;by redefining them in our script though.

  ;;(def default-node-count 10)
  ;;(def plan-path "plan.edn")

  #_
  (def default-plans
    {"AP" {:path path-AP :input-map input-map-AP :plan-path "planAP.edn"}
     "BP" {:path path-BP :input-map input-map-BP :plan-path "planBP.edn"}})

   ;;emit an optimized run-plan.
  (prep-batches)
#+END_SRC

In the preceding example, we would produce plans at ./planAP.edn and ./planBP.edn
which can then be referenced in our subsequent array job scripting on PBS.

We assume these run-plans already exist (as well as ~batch_test.clj~ or a
comparable script) going forward.

~prep-batches~ leverages a simple simulating annealing algorithm to try to
efficiently pack the estimated volume of work into node-count bins. Since
replications are (by default) dependent on the volume of a particular design
point, leveraging packing instead of a naive round-robin or randomized solution
subsantially improves our makespan.

** Per-Node Execution
Executing a job on a node loosely boils down to:
- Get a reference to a run-plan
- Get a reference to an input map
- Read the run-plan
- Look up the corresponding job array index from the environment variable for this
  node (supplied by PBS)
- invoke a batch-run provided by ~taa.core/run-from-plan~ with the run-plan,
  index, and input-map

The script ~batch_script.clj~ encapsulates these facilities.
It provides a simplistic entry point for "doing a piece of work" in a call to ~run-me~:

#+BEGIN_SRC clojure
  (defn run-me []
    (taa.core/run-from-plan "planAP.edn" job-index batch/input-map-AP))
#+END_SRC

where ~job-index~ is bound to the environment variable ~PBS_ARRAY_INDEX~, and
we have ~batch_test.clj~ loaded and in scope to provide matching input maps.

Upon execution on a node, we expect to see 1 or more "results" files in the form of
#+BEGIN_SRC shell
  batch_0_results.txt
  batch_1_results.txt
  ...
  batch_k_results.txt
#+END_SRC

These are intended to be concatenated by an aggregating process.  We can accomodate
that in the ~batch_script.clj~ ~run-me~ function trivially, e.g. if we want to copy
files to an off-node directory, or concat the files and then offload,etc.

