README.html
<div id="outline-container-orga74d54e" class="outline-3">
<h3 id="orga74d54e"><span class="section-number-3">5.2.</span> Emitting Run Plans</h3>
<div class="outline-text-3" id="text-5-2">
<p>
We can leverage much of the existing TAA pipeline to generate a
persistent plan.  From there, we can try to optimize our plan such
that the total makespan of the work is minimized, which naturally leads
to an even distribution of work across a set of nodes.
</p>

<p>
The inputs we care about are:
</p>
<ul class="org-ul">
<li>a pre-supplied MARATHON workbook to provide a project we can manage in memory</li>
<li>a companion TAA input-map that supplies transforms and other parameters that
inform how a project is decomposed into design points and replications to
ultimately constitute a batch of work (or simulation runs)</li>
<li>how many nodes we expect to distribute the runs over</li>
<li>a hueristic that helps us estimate the amount of effort or cost
required for a particular design point.
<ul class="org-ul">
<li>We will use a simple estimate of the total supply of entities,
since that strongly correlates with events in the simulation.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org9480e68" class="outline-4">
<h4 id="org9480e68"><span class="section-number-4">5.2.1.</span> workbook</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
This is assumed to be pre-supplied to any nodes that need to get at it.
Specifically, we assume it is available relative to some known path.
</p>

<p>
We have 2 sample workbooks in /data
</p>
<ul class="org-ul">
<li><code>m4_book_AP.xlsx</code></li>
<li><code>m4_book_BP.xlsx</code></li>
</ul>
</div>
</div>
<div id="outline-container-org8d046e9" class="outline-4">
<h4 id="org8d046e9"><span class="section-number-4">5.2.2.</span> input-map</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
This is a clojure map either serialized in .edn format (e.g.
a readable clojure data structure that can be deserialized by
the clojure reader natively), or defined and used in-memory
within a clojure script.  Our examples will follow the in-memory
model, and we will have input maps for each workbook.
</p>
</div>
</div>
<div id="outline-container-org56be10c" class="outline-4">
<h4 id="org56be10c"><span class="section-number-4">5.2.3.</span> node-count</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
We intentionally keep this variable to allow our plan to
adapt to resourcing.
</p>
</div>
</div>
</div>
<div id="outline-container-org73003df" class="outline-3">
<h3 id="org73003df"><span class="section-number-3">5.3.</span> Planning vs. Execution</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The preferred approach is to have a reusable script that
can be used to both setup / emit a persistent run-plan,
in addition to performing incremental runs relative to
a job array index.
</p>

<p>
The <code>batch_test.clj</code> script provides an example and a minimal
API to build our PBS job on.  It supplies the relevant input
maps and workbook paths, as well as a function to emit an
optimized run-plan.
</p>
</div>
<div id="outline-container-orgf3d6b8b" class="outline-4">
<h4 id="orgf3d6b8b"><span class="section-number-4">5.3.1.</span> Setup</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Since our method of plan generation is relatively cheap,
we want to build our plans outside of PBS.  Run plans
can then be propagated to worker nodes for them to
map a job array index to their relevant piece of the
run plan.
</p>

<p>
From either a clojure repl, or an aforementioned CLI
invocation, we can leverage the simplistic <code>prep-batches</code>
function in conjuction with simple plan definitions in the
<code>default-plans</code> var.
</p>

<p>
If we nothing to modify the script, any invocation of
the 0-arity <code>prep-batches</code> will leverage <code>default-plans</code> to
do its work:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>load-file <span style="color: #2d9574;">"batch_test.clj"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">load and eval arbitrary source file.</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">in-ns</span> 'batch-test<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">switch the repl namespace to batch-test</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">These values are already defined.  We could change them</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">by redefining them in our script though.</span>

<span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">(def default-node-count 10)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">(def plan-path "plan.edn")</span>

#_
<span style="color: #4f97d7; background-color: #292e34;">(</span><span style="color: #2aa1ae; background-color: #292e34;">def default-plans</span>
<span style="color: #2aa1ae; background-color: #292e34;">  </span><span style="color: #bc6ec5; background-color: #292e34;">{</span><span style="color: #2aa1ae; background-color: #292e34;">"AP" </span><span style="color: #2d9574; background-color: #292e34;">{</span><span style="color: #2aa1ae; background-color: #292e34;">:path path-AP :input-map input-map-AP :plan-path "planAP.edn"</span><span style="color: #2d9574; background-color: #292e34;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">   "BP" </span><span style="color: #2d9574; background-color: #292e34;">{</span><span style="color: #2aa1ae; background-color: #292e34;">:path path-BP :input-map input-map-BP :plan-path "planBP.edn"</span><span style="color: #2d9574; background-color: #292e34;">}</span><span style="color: #bc6ec5; background-color: #292e34;">}</span><span style="color: #4f97d7; background-color: #292e34;">)</span>

 <span style="color: #2aa1ae; background-color: #292e34;">;;</span><span style="color: #2aa1ae; background-color: #292e34;">emit an optimized run-plan.</span>
<span style="color: #4f97d7;">(</span>prep-batches<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
In the preceding example, we would produce plans at ./planAP.edn and ./planBP.edn
which can then be referenced in our subsequent array job scripting on PBS.
</p>

<p>
We assume these run-plans already exist (as well as <code>batch_test.clj</code> or a
comparable script) going forward.
</p>

<p>
<code>prep-batches</code> leverages a simple simulating annealing algorithm to try to
efficiently pack the estimated volume of work into node-count bins. Since
replications are (by default) dependent on the volume of a particular design
point, leveraging packing instead of a naive round-robin or randomized solution
subsantially improves our makespan.
</p>
</div>
</div>
</div>
<div id="outline-container-orga2a1d97" class="outline-3">
<h3 id="orga2a1d97"><span class="section-number-3">5.4.</span> Per-Node Execution</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Executing a job on a node loosely boils down to:
</p>
<ul class="org-ul">
<li>Get a reference to a run-plan</li>
<li>Get a reference to an input map</li>
<li>Read the run-plan</li>
<li>Look up the corresponding job array index from the environment variable for this
node (supplied by PBS)</li>
<li>invoke a batch-run provided by <code>taa.core/run-from-plan</code> with the run-plan,
index, and input-map</li>
</ul>

<p>
The script <code>batch_script.clj</code> encapsulates these facilities.
It provides a simplistic entry point for "doing a piece of work" in a call to <code>run-me</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">run-me</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">taa.core</span>/run-from-plan <span style="color: #2d9574;">"planAP.edn"</span> job-index <span style="color: #ce537a; font-weight: bold;">batch</span>/input-map-AP<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
where <code>job-index</code> is bound to the environment variable <code>PBS_ARRAY_INDEX</code>, and
we have <code>batch_test.clj</code> loaded and in scope to provide matching input maps.
</p>

<p>
Upon execution on a node, we expect to see 1 or more "results" files in the form of
</p>
<div class="org-src-container">
<pre class="src src-shell">batch_0_results.txt
batch_1_results.txt
...
batch_k_results.txt
</pre>
</div>

<p>
These are intended to be concatenated by an aggregating process.  We can accomodate
that in the <code>batch_script.clj</code> <code>run-me</code> function trivially, e.g. if we want to copy
files to an off-node directory, or concat the files and then offload,etc.
</p>
</div>
</div>
