README.org
** Job Submission
The last piece of our setup is interacting with the PBS system to get a job array
submitted that can use our infrastucture.

Given the following files in our home directory (or another directory):
- ~m4-2.25.jar~
- ~batch_test.clj~
- ~batch_script.clj~
- ~m4book_AP.xlsx~
- ~planAP.edn~

we can leverage a PBS script to tie it all together:

- batch.pbs

wherein we can provide a custom CLI invocation
to setup our M4 node to process a piece of the
job array:

#+BEGIN_SRC bash
  #!/bin/bash
  #PBS -l select=1:ncpus=48:mpiprocs=48
  #PBS -l walltime=00:20:00
  #PBS -A Project_ID
  #PBS -q debug
  #PBS -N Job_Array_Test
  #PBS -J 0-12:3
  #PBS -j oe
  #PBS -V

  #comments elided

  java -XX:+UseParallelGC -Xmx250g -jar m4-2.24.jar clojure.main batch_script.clj
#+END_SRC

We can customize the jvm args as necessary relative to node resources (e.g., RAM).
