README.html
<div id="outline-container-org8731e88" class="outline-3">
<h3 id="org8731e88"><span class="section-number-3">5.5.</span> Job Submission</h3>
<div class="outline-text-3" id="text-5-5">
<p>
The last piece of our setup is interacting with the PBS system to get a job array
submitted that can use our infrastucture.
</p>

<p>
Given the following files in our home directory (or another directory):
</p>
<ul class="org-ul">
<li><code>m4-2.25.jar</code></li>
<li><code>batch_test.clj</code></li>
<li><code>batch_script.clj</code></li>
<li><code>m4book_AP.xlsx</code></li>
<li><code>planAP.edn</code></li>
</ul>

<p>
we can leverage a PBS script to tie it all together:
</p>

<ul class="org-ul">
<li>batch.pbs</li>
</ul>

<p>
wherein we can provide a custom CLI invocation
to setup our M4 node to process a piece of the
job array:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l select=1:ncpus=48:mpiprocs=48</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -l walltime=00:20:00</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -A Project_ID</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -q debug</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -N Job_Array_Test</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -J 0-12:3</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -j oe</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">PBS -V</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">comments elided</span>

java -XX:+UseParallelGC -Xmx250g -jar m4-2.24.jar clojure.main batch_script.clj
</pre>
</div>

<p>
We can customize the jvm args as necessary relative to node resources (e.g., RAM).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 21 January 2026</p>
<p class="author">Author: M4 Dev</p>
<p class="date">Created: 2026-01-21 Wed 10:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
